Tekla Open API Reference for Tekla Structures 2025
Bolt.BoltAttributes.Representation Property
 The representation type of the bolt.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Bolt.Representation Representation { get; set; }
Public Property Representation As Bolt.Representation
	Get
	Set
Property Value
Type: Bolt.Representation
See Also
Reference
Bolt.BoltAttributes Class
Tekla.Structures.Drawing Namespace